<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"s3","label":"prod","backend":"71af8e958f6f868139fb36a9cf6faee3c6c35c4a3c8cb763ee52f0c73a6e48e6","plan_job_ref":"Job CICD for Splitrr Infra #67 at https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10684751080","plan_out_hash":"29d14b409ea11b5e453a810596bbbe321dcec217077a4c36443ec19a2a2535f2","plan_hash":"1122b7d453fd9a5f86a0e924a134eceee05579e598346b9246bd026d9de2de63","plan_text_format":"diff-trunc","version":"1.44.0"} -->
Terraform plan for __prod__
<details>
<summary>Plan: 85 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_secretsmanager_secret_version.dev_secrets will be read during apply
  # (config refers to values not yet known)
 <= data "aws_secretsmanager_secret_version" "dev_secrets" {
+       arn            = (known after apply)
+       created_date   = (known after apply)
+       id             = (known after apply)
+       secret_binary  = (sensitive value)
+       secret_id      = (known after apply)
+       secret_string  = (sensitive value)
+       version_id     = (known after apply)
+       version_stages = (known after apply)
    }

  # aws_kms_alias.terraform_state will be created
+   resource "aws_kms_alias" "terraform_state" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       name           = "alias/splitrr-prod-terraform-state"
+       name_prefix    = (known after apply)
+       target_key_arn = (known after apply)
+       target_key_id  = (known after apply)
    }

  # aws_kms_key.terraform_state will be created
+   resource "aws_kms_key" "terraform_state" {
+       arn                                = (known after apply)
+       bypass_policy_lockout_safety_check = false
+       customer_master_key_spec           = "*****************"
+       description                        = "This key is used to encrypt bucket objects"
+       enable_key_rotation                = false
+       id                                 = (known after apply)
+       is_enabled                         = true
+       key_id                             = (known after apply)
+       key_usage                          = "ENCRYPT_DECRYPT"
+       multi_region                       = (known after apply)
+       policy                             = (known after apply)
+       rotation_period_in_days            = (known after apply)
+       tags_all                           = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }
    }

  # aws_s3_bucket.terraform_state will be created
+   resource "aws_s3_bucket" "terraform_state" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "splitrr-prod-terraform-state"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # aws_s3_bucket_public_access_block.terraform_state will be created
+   resource "aws_s3_bucket_public_access_block" "terraform_state" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.terraform_state will be created
+   resource "aws_s3_bucket_server_side_encryption_configuration" "terraform_state" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           bucket_key_enabled = true

+           apply_server_side_encryption_by_default {
+               kms_master_key_id = (known after apply)
+               sse_algorithm     = "aws:kms"
            }
        }
    }

  # aws_s3_bucket_versioning.terraform_state will be created
+   resource "aws_s3_bucket_versioning" "terraform_state" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       versioning_configuration {
+           mfa_delete = (known after apply)
+           status     = "Enabled"
        }
    }

  # module.alb.aws_alb.splitrr_alb will be created
+   resource "aws_alb" "splitrr_alb" {
+       arn                                                          = (known after apply)
+       arn_suffix                                                   = (known after apply)
+       client_keep_alive                                            = 3600
+       desync_mitigation_mode                                       = "defensive"
+       dns_name                                                     = (known after apply)
+       drop_invalid_header_fields                                   = false
+       enable_deletion_protection                                   = false
+       enable_http2                                                 = true
+       enable_tls_version_and_cipher_suite_headers                  = false
+       enable_waf_fail_open                                         = false
+       enable_xff_client_port                                       = false
+       enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
+       id                                                           = (known after apply)
+       idle_timeout                                                 = 60
+       internal                                                     = false
+       ip_address_type                                              = (known after apply)
+       load_balancer_type                                           = "application"
+       name                                                         = "splitrr-prod-alb"
+       name_prefix                                                  = (known after apply)
+       preserve_host_header                                         = false
+       security_groups                                              = (known after apply)
+       subnets                                                      = (known after apply)
+       tags                                                         = {
+           "Name" = "splitrr-prod-alb"
        }
+       tags_all                                                     = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-prod-alb"
+           "Project" = "Splitrr"
        }
+       vpc_id                                                       = (known after apply)
+       xff_header_processing_mode                                   = "append"
+       zone_id                                                      = (known after apply)

+       subnet_mapping (known after apply)
    }

  # module.alb.aws_alb_listener.backend_end will be created
+   resource "aws_alb_listener" "backend_end" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       load_balancer_arn = (known after apply)
+       port              = 80
+       protocol          = "HTTP"
+       ssl_policy        = (known after apply)
+       tags              = {
+           "Name" = "splitrr-prod-alb-listener"
        }
+       tags_all          = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-prod-alb-listener"
+           "Project" = "Splitrr"
        }

+       default_action {
+           order = (known after apply)
+           type  = "redirect"

+           redirect {
+               host        = "#{host}"
+               path        = "/#{path}"
+               port        = "443"
+               protocol    = "HTTPS"
+               query       = "#{query}"
+               status_code = "HTTP_301"
            }
        }

+       mutual_authentication (known after apply)
    }

  # module.alb.aws_alb_listener.https_listener will be created
+   resource "aws_alb_listener" "https_listener" {
+       arn               = (known after apply)
+       certificate_arn   = (known after apply)
+       id                = (known after apply)
+       load_balancer_arn = (known after apply)
+       port              = 443
+       protocol          = "HTTPS"
+       ssl_policy        = "ELBSecurityPolicy-TLS13-1-2-2021-06"
+       tags              = {
+           "Name" = "splitrr-prod-alb-https-listener"
        }
+       tags_all          = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-prod-alb-https-listener"
+           "Project" = "Splitrr"
        }

+       default_action {
+           order = (known after apply)
+           type  = "fixed-response"

+           fixed_response {
+               content_type = "text/plain"
+               message_body = "Not Found"
+               status_code  = "404"
            }
        }

+       mutual_authentication (known after apply)
    }

  # module.alb.aws_security_group.lb will be created
+   resource "aws_security_group" "lb" {
+       arn                    = (known after apply)
+       description            = "controls access to the ALB"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
#                (1 unchanged attribute hidden)
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 443
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 443
#                (1 unchanged attribute hidden)
            },
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 80
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 80
#                (1 unchanged attribute hidden)
            },
        ]
+       name                   = "splitrr-prod-alb-lb-sg"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "splitrr-prod-alb-lb-sg"
        }
+       tags_all               = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-prod-alb-lb-sg"
+           "Project" = "Splitrr"
        }
+       vpc_id                 = (known after apply)
    }

  # module.alb_acm.data.aws_route53_zone.route53_zone will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_route53_zone" "route53_zone" {
+       arn                        = (known after apply)
+       caller_reference           = (known after apply)
+       comment                    = (known after apply)
+       id                         = (known after apply)
+       linked_service_description = (known after apply)
+       linked_service_principal   = (known after apply)
+       name                       = "prod.bibek65.tech"
+       name_servers               = (known after apply)
+       primary_name_server        = (known after apply)
+       private_zone               = false
+       resource_record_set_count  = (known after apply)
+       tags                       = (known after apply)
+       vpc_id                     = (known after apply)
+       zone_id                    = (known after apply)
    }

  # module.alb_acm.aws_acm_certificate.acm_certificate will be created
+   resource "aws_acm_certificate" "acm_certificate" {
+       arn                       = (known after apply)
+       domain_name               = "prod.bibek65.tech"
+       domain_validation_options = [
+           {
+               domain_name           = "api.prod.bibek65.tech"
+               resource_record_name  = (known after apply)
+               resource_record_type  = (known after apply)
+               resource_record_value = (known after apply)
            },
+           {
+               domain_name           = "prod.bibek65.tech"
+               resource_record_name  = (known after apply)
+               resource_record_type  = (known after apply)
+               resource_record_value = (known after apply)
            },
        ]
+       id                        = (known after apply)
+       key_algorithm             = (known after apply)
+       not_after                 = (known after apply)
+       not_before                = (known after apply)
+       pending_renewal           = (known after apply)
+       renewal_eligibility       = (known after apply)
+       renewal_summary           = (known after apply)
+       status                    = (known after apply)
+       subject_alternative_names = [
+           "api.prod.bibek65.tech",
+           "prod.bibek65.tech",
        ]
+       tags                      = {
+           "Name" = "splitrr-prod-alb-acm"
        }
+       tags_all                  = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-prod-alb-acm"
+           "Project" = "Splitrr"
        }
+       type                      = (known after apply)
+       validation_emails         = (known after apply)
+       validation_method         = "DNS"

+       options (known after apply)
    }

  # module.alb_acm.aws_acm_certificate_validation.acm_certificate_validation will be created
+   resource "aws_acm_certificate_validation" "acm_certificate_validation" {
+       certificate_arn         = (known after apply)
+       id                      = (known after apply)
+       validation_record_fqdns = (known after apply)
    }

  # module.alb_acm.aws_route53_record.route53_record["api.prod.bibek65.tech"] will be created
+   resource "aws_route53_record" "route53_record" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = (known after apply)
+       records         = (known after apply)
+       ttl             = 60
+       type            = (known after apply)
+       zone_id         = (known after apply)
    }

  # module.alb_acm.aws_route53_record.route53_record["prod.bibek65.tech"] will be created
+   resource "aws_route53_record" "route53_record" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = (known after apply)
+       records         = (known after apply)
+       ttl             = 60
+       type            = (known after apply)
+       zone_id         = (known after apply)
    }

  # module.app_route53_record.aws_route53_record.site_domain will be created
+   resource "aws_route53_record" "site_domain" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "app"
+       type            = "A"
+       zone_id         = (known after apply)

+       alias {
+           evaluate_target_health = true
+           name                   = (known after apply)
+           zone_id                = (known after apply)
        }
    }

  # module.backend_route53_record.aws_route53_record.site_domain will be created
+   resource "aws_route53_record" "site_domain" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "api"
+       type            = "A"
+       zone_id         = (known after apply)

+       alias {
+           evaluate_target_health = true
+           name                   = (known after apply)
+           zone_id                = (known after apply)
        }
    }

  # module.cloudfront.data.aws_iam_policy_document.origin will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "origin" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "1"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   (known after apply),
                ]
+               variable = "AWS:SourceArn"
            }

+           principals {
+               identifiers = [
+                   "cloudfront.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.cloudfront.data.aws_s3_bucket.s3 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_s3_bucket" "s3" {
+       arn                         = (known after apply)
+       bucket                      = (known after apply)
+       bucket_domain_name          = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       region                      = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # module.cloudfront.aws_cloudfront_distribution.s3_distribution will be created
+   resource "aws_cloudfront_distribution" "s3_distribution" {
+       aliases                         = [
+           "app.prod.bibek65.tech",
        ]
+       arn                             = (known after apply)
+       caller_reference                = (known after apply)
+       continuous_deployment_policy_id = (known after apply)
+       default_root_object             = "index.html"
+       domain_name                     = (known after apply)
+       enabled                         = true
+       etag                            = (known after apply)
+       hosted_zone_id                  = (known after apply)
+       http_version                    = "http2"
+       id                              = (known after apply)
+       in_progress_validation_batches  = (known after apply)
+       is_ipv6_enabled                 = false
+       last_modified_time              = (known after apply)
+       price_class                     = "PriceClass_100"
+       retain_on_delete                = false
+       staging                         = false
+       status                          = (known after apply)
+       tags                            = {
+           "Name" = "Cloud Front"
        }
+       tags_all                        = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "Cloud Front"
+           "Project" = "Splitrr"
        }
+       trusted_key_groups              = (known after apply)
+       trusted_signers                 = (known after apply)
+       wait_for_deployment             = true

+       default_cache_behavior {
+           allowed_methods        = [
+               "GET",
+               "HEAD",
            ]
+           cached_methods         = [
+               "GET",
+               "HEAD",
            ]
+           compress               = false
+           default_ttl            = (known after apply)
+           max_ttl                = (known after apply)
+           min_ttl                = 0
+           target_origin_id       = (known after apply)
+           trusted_key_groups     = (known after apply)
+           trusted_signers        = (known after apply)
+           viewer_protocol_policy = "redirect-to-https"

+           forwarded_values {
+               headers                 = (known after apply)
+               query_string            = false
+               query_string_cache_keys = (known after apply)

+               cookies {
+                   forward           = "none"
+                   whitelisted_names = (known after apply)
                }
            }
        }

+       origin {
+           connection_attempts      = 3
+           connection_timeout       = 10
+           domain_name              = (known after apply)
+           origin_access_control_id = (known after apply)
+           origin_id                = (known after apply)
#            (1 unchanged attribute hidden)
        }

+       restrictions {
+           geo_restriction {
+               locations        = (known after apply)
+               restriction_type = "none"
            }
        }

+       viewer_certificate {
+           acm_certificate_arn      = (known after apply)
+           minimum_protocol_version = "TLSv1.2_2021"
+           ssl_support_method       = "sni-only"
        }
    }

  # module.cloudfront.aws_cloudfront_origin_access_control.s3_distribution will be created
+   resource "aws_cloudfront_origin_access_control" "s3_distribution" {
+       description                       = "OAC setup for S3_OAC"
+       etag                              = (known after apply)
+       id                                = (known after apply)
+       name                              = "CLOUDFRONT-OAC"
+       origin_access_control_origin_type = "s3"
+       signing_behavior                  = "always"
+       signing_protocol                  = "sigv4"
    }

  # module.cloudfront.aws_s3_bucket_policy.origin will be created
+   resource "aws_s3_bucket_policy" "origin" {
+       bucket = (known after apply)
+       id     = (known after apply)
+       policy = (known after apply)
    }

  # module.cloudfront_acm.data.aws_route53_zone.route53_zone will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_route53_zone" "route53_zone" {
+       arn                        = (known after apply)
+       caller_reference           = (known after apply)
+       comment                    = (known after apply)
+       id                         = (known after apply)
+       linked_service_description = (known after apply)
+       linked_service_principal   = (known after apply)
+       name                       = "prod.bibek65.tech"
+       name_servers               = (known after apply)
+       primary_name_server        = (known after apply)
+       private_zone               = false
+       resource_record_set_count  = (known after apply)
+       tags                       = (known after apply)
+       vpc_id                     = (known after apply)
+       zone_id                    = (known after apply)
    }

  # module.cloudfront_acm.aws_acm_certificate.acm_certificate will be created
+   resource "aws_acm_certificate" "acm_certificate" {
+       arn                       = (known after apply)
+       domain_name               = "prod.bibek65.tech"
+       domain_validation_options = [
+           {
+               domain_name           = "app.prod.bibek65.tech"
+               resource_record_name  = (known after apply)
+               resource_record_type  = (known after apply)
+               resource_record_value = (known after apply)
            },
+           {
+               domain_name           = "prod.bibek65.tech"
+               resource_record_name  = (known after apply)
+               resource_record_type  = (known after apply)
+               resource_record_value = (known after apply)
            },
        ]
+       id                        = (known after apply)
+       key_algorithm             = (known after apply)
+       not_after                 = (known after apply)
+       not_before                = (known after apply)
+       pending_renewal           = (known after apply)
+       renewal_eligibility       = (known after apply)
+       renewal_summary           = (known after apply)
+       status                    = (known after apply)
+       subject_alternative_names = [
+           "app.prod.bibek65.tech",
+           "prod.bibek65.tech",
        ]
+       tags                      = {
+           "Name" = "splitrr-prod-cloudfront-acm"
        }
+       tags_all                  = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-prod-cloudfront-acm"
+           "Project" = "Splitrr"
        }
+       type                      = (known after apply)
+       validation_emails         = (known after apply)
+       validation_method         = "DNS"

+       options (known after apply)
    }

  # module.cloudfront_acm.aws_acm_certificate_validation.acm_certificate_validation will be created
+   resource "aws_acm_certificate_validation" "acm_certificate_validation" {
+       certificate_arn         = (known after apply)
+       id                      = (known after apply)
+       validation_record_fqdns = (known after apply)
    }

  # module.cloudfront_acm.aws_route53_record.route53_record["app.prod.bibek65.tech"] will be created
+   resource "aws_route53_record" "route53_record" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = (known after apply)
+       records         = (known after apply)
+       ttl             = 60
+       type            = (known after apply)
+       zone_id         = (known after apply)
    }

  # module.cloudfront_acm.aws_route53_record.route53_record["prod.bibek65.tech"] will be created
+   resource "aws_route53_record" "route53_record" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = (known after apply)
+       records         = (known after apply)
+       ttl             = 60
+       type            = (known after apply)
+       zone_id         = (known after apply)
    }

  # module.cognito.aws_cognito_identity_pool.identity_pool will be created
+   resource "aws_cognito_identity_pool" "identity_pool" {
+       allow_classic_flow               = false
+       allow_unauthenticated_identities = false
+       arn                              = (known after apply)
+       id                               = (known after apply)
+       identity_pool_name               = "splitrr-prod-cognito-identity-pool"
+       tags_all                         = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }

+       cognito_identity_providers {
+           client_id               = (known after apply)
+           provider_name           = (known after apply)
+           server_side_token_check = false
        }
    }

  # module.cognito.aws_cognito_user_pool.user_pool will be created
+   resource "aws_cognito_user_pool" "user_pool" {
+       arn                        = (known after apply)
+       auto_verified_attributes   = [
+           "email",
        ]
+       creation_date              = (known after apply)
+       custom_domain              = (known after apply)
+       deletion_protection        = "INACTIVE"
+       domain                     = (known after apply)
+       email_verification_message = (known after apply)
+       email_verification_subject = (known after apply)
+       endpoint                   = (known after apply)
+       estimated_number_of_users  = (known after apply)
+       id                         = (known after apply)
+       last_modified_date         = (known after apply)
+       mfa_configuration          = "OFF"
+       name                       = "splitrr-prod-cognito-user-pool"
+       sms_verification_message   = (known after apply)
+       tags                       = {
+           "Name" = "splitrr-prod-cognito-user-pool"
        }
+       tags_all                   = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-prod-cognito-user-pool"
+           "Project" = "Splitrr"
        }

+       account_recovery_setting {
+           recovery_mechanism {
+               name     = "verified_email"
+               priority = 1
            }
+           recovery_mechanism {
+               name     = "verified_phone_number"
+               priority = 2
            }
        }

+       admin_create_user_config {
+           allow_admin_create_user_only = false
        }

+       password_policy {
+           minimum_length                   = 8
+           require_lowercase                = true
+           require_numbers                  = true
+           require_symbols                  = true
+           require_uppercase                = true
+           temporary_password_validity_days = (known after apply)
        }

+       sms_configuration (known after apply)

+       verification_message_template (known after apply)
    }

  # module.cognito.aws_cognito_user_pool_client.user_pool_client will be created
+   resource "aws_cognito_user_pool_client" "user_pool_client" {
+       access_token_validity                         = (known after apply)
+       allowed_oauth_flows                           = (known after apply)
+       allowed_oauth_flows_user_pool_client          = (known after apply)
+       allowed_oauth_scopes                          = (known after apply)
+       auth_session_validity                         = (known after apply)
+       callback_urls                                 = (known after apply)
+       client_secret                                 = (sensitive value)
+       default_redirect_uri                          = (known after apply)
+       enable_propagate_additional_user_context_data = (known after apply)
+       enable_token_revocation                       = (known after apply)
+       explicit_auth_flows                           = [
+           "ALLOW_CUSTOM_AUTH",
+           "ALLOW_REFRESH_TOKEN_AUTH",
+           "ALLOW_USER_PASSWORD_AUTH",
+           "ALLOW_USER_SRP_AUTH",
        ]
+       generate_secret                               = false
+       id                                            = (known after apply)
+       id_token_validity                             = (known after apply)
+       logout_urls                                   = (known after apply)
+       name                                          = "splitrr-prod-cognito-user-pool-client"
+       prevent_user_existence_errors                 = (known after apply)
+       read_attributes                               = (known after apply)
+       refresh_token_validity                        = (known after apply)
+       supported_identity_providers                  = (known after apply)
+       user_pool_id                                  = (known after apply)
+       write_attributes                              = (known after apply)
    }

  # module.ecr.aws_ecr_lifecycle_policy.ecr_policy will be created
+   resource "aws_ecr_lifecycle_policy" "ecr_policy" {
+       id          = (known after apply)
+       policy      = jsonencode(
            {
+               rules = [
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "Expire images older than 14 days"
+                       rulePriority = 1
+                       selection    = {
+                           countNumber = 14
+                           countType   = "sinceImagePushed"
+                           countUnit   = "days"
+                           tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
+       registry_id = (known after apply)
+       repository  = "splitrr-prod-ecr-repository"
    }

  # module.ecr.aws_ecr_repository.app will be created
+   resource "aws_ecr_repository" "app" {
+       arn                  = (known after apply)
+       id                   = (known after apply)
+       image_tag_mutability = "MUTABLE"
+       name                 = "splitrr-prod-ecr-repository"
+       registry_id          = (known after apply)
+       repository_url       = (known after apply)
+       tags                 = {
+           "Name" = "splitrr-prod-ecr-repository"
        }
+       tags_all             = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-prod-ecr-repository"
+           "Project" = "Splitrr"
        }

+       encryption_configuration {
+           encryption_type = "KMS"
+           kms_key         = (known after apply)
        }

+       image_scanning_configuration {
+           scan_on_push = true
        }
    }

  # module.ecr.aws_kms_key.kms_key will be created
+   resource "aws_kms_key" "kms_key" {
+       arn                                = (known after apply)
+       bypass_policy_lockout_safety_check = false
+       customer_master_key_spec           = "*****************"
+       description                        = "KMS key for splitrr-prod-ecr"
+       enable_key_rotation                = true
+       id                                 = (known after apply)
+       is_enabled                         = true
+       key_id                             = (known after apply)
+       key_usage                          = "ENCRYPT_DECRYPT"
+       multi_region                       = (known after apply)
+       policy                             = (known after apply)
+       rotation_period_in_days            = (known after apply)
+       tags                               = {
+           "Name" = "splitrr-prod-ecr-kms-key"
        }
+       tags_all                           = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-prod-ecr-kms-key"
+           "Project" = "Splitrr"
        }
    }

  # module.ecs-ec2.data.aws_iam_policy_document.ecs_node_doc will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ecs_node_doc" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRole",
            ]
+           effect  = "Allow"

+           principals {
+               identifiers = [
+                   "ec2.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.ecs-ec2.aws_appautoscaling_policy.ecs_target_cpu will be created
+   resource "aws_appautoscaling_policy" "ecs_target_cpu" {
+       alarm_arns         = (known after apply)
+       arn                = (known after apply)
+       id                 = (known after apply)
+       name               = "splitrr-prod-backend-ecs-ec2-cpu-policy"
+       policy_type        = "TargetTrackingScaling"
+       resource_id        = "*********************************************************************************"
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"

+       target_tracking_scaling_policy_configuration {
+           disable_scale_in   = false
+           scale_in_cooldown  = 300
+           scale_out_cooldown = 300
+           target_value       = 80

+           predefined_metric_specification {
+               predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.ecs-ec2.aws_appautoscaling_policy.ecs_target_memory will be created
+   resource "aws_appautoscaling_policy" "ecs_target_memory" {
+       alarm_arns         = (known after apply)
+       arn                = (known after apply)
+       id                 = (known after apply)
+       name               = "splitrr-prod-backend-ecs-ec2-memory-policy"
+       policy_type        = "TargetTrackingScaling"
+       resource_id        = "*********************************************************************************"
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"

+       target_tracking_scaling_policy_configuration {
+           disable_scale_in   = false
+           scale_in_cooldown  = 300
+           scale_out_cooldown = 300
+           target_value       = 80

+           predefined_metric_specification {
+               predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.ecs-ec2.aws_appautoscaling_target.ecs_target will be created
+   resource "aws_appautoscaling_target" "ecs_target" {
+       arn                = (known after apply)
+       id                 = (known after apply)
+       max_capacity       = 1
+       min_capacity       = 1
+       resource_id        = "*********************************************************************************"
+       role_arn           = (known after apply)
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"
+       tags_all           = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }

+       suspended_state (known after apply)
    }

  # module.ecs-ec2.aws_autoscaling_group.app_asg will be created
+   resource "aws_autoscaling_group" "app_asg" {
+       arn                              = (known after apply)
+       availability_zones               = (known after apply)
+       default_cooldown                 = (known after apply)
+       desired_capacity                 = 1
+       force_delete                     = false
+       force_delete_warm_pool           = false
+       health_check_grace_period        = 0
+       health_check_type                = "EC2"
+       id                               = (known after apply)
+       ignore_failed_scaling_activities = false
+       load_balancers                   = (known after apply)
+       max_size                         = 2
+       metrics_granularity              = "1Minute"
+       min_size                         = 1
+       name                             = (known after apply)
+       name_prefix                      = (known after apply)
+       predicted_capacity               = (known after apply)
+       protect_from_scale_in            = false
+       service_linked_role_arn          = (known after apply)
+       target_group_arns                = (known after apply)
+       vpc_zone_identifier              = (known after apply)
+       wait_for_capacity_timeout        = "10m"
+       warm_pool_size                   = (known after apply)

+       launch_template {
+           id      = (known after apply)
+           name    = (known after apply)
+           version = "$Latest"
        }

+       mixed_instances_policy (known after apply)

+       tag {
+           key                 = "Creator"
+           propagate_at_launch = true
+           value               = "bibeklabh@lftechnology.com"
        }
+       tag {
+           key                 = "Name"
+           propagate_at_launch = true
+           value               = "splitrr-prod-backend-ecs-ec2-asg"
        }
+       tag {
+           key                 = "Project"
+           propagate_at_launch = true
+           value               = "Splitrr"
        }

+       traffic_source (known after apply)
    }

  # module.ecs-ec2.aws_cloudwatch_log_group.ecs will be created
+   resource "aws_cloudwatch_log_group" "ecs" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       log_group_class   = (known after apply)
+       name              = "/ecs/splitrr-prod-backend-ecs-ec2"
+       name_prefix       = (known after apply)
+       retention_in_days = 14
+       skip_destroy      = false
+       tags              = {
+           "Name" = "splitrr-prod-backend-ecs-ec2-log-group"
        }
+       tags_all          = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-prod-backend-ecs-ec2-log-group"
+           "Project" = "Splitrr"
        }
    }

  # module.ecs-ec2.aws_ecs_capacity_provider.main will be created
+   resource "aws_ecs_capacity_provider" "main" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       name     = "splitrr-prod-backend-ecs-ec2-capacity-provider"
+       tags_all = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }

+       auto_scaling_group_provider {
+           auto_scaling_group_arn         = (known after apply)
+           managed_draining               = (known after apply)
+           managed_termination_protection = "DISABLED"

+           managed_scaling {
+               instance_warmup_period    = (known after apply)
+               maximum_scaling_step_size = 1
+               minimum_scaling_step_size = 1
+               status                    = "ENABLED"
+               target_capacity           = 100
            }
        }
    }

  # module.ecs-ec2.aws_ecs_cluster.main will be created
+   resource "aws_ecs_cluster" "main" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       name     = "splitrr-prod-backend-ecs-ec2-cluster"
+       tags     = {
+           "Name" = "splitrr-prod-backend-ecs-ec2-cluster"
        }
+       tags_all = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-prod-backend-ecs-ec2-cluster"
+           "Project" = "Splitrr"
        }

+       setting (known after apply)
    }

  # module.ecs-ec2.aws_ecs_cluster_capacity_providers.main will be created
+   resource "aws_ecs_cluster_capacity_providers" "main" {
+       capacity_providers = [
+           "splitrr-prod-backend-ecs-ec2-capacity-provider",
        ]
+       cluster_name       = "splitrr-prod-backend-ecs-ec2-cluster"
+       id                 = (known after apply)

+       default_capacity_provider_strategy {
+           base              = 1
+           capacity_provider = "splitrr-prod-backend-ecs-ec2-capacity-provider"
+           weight            = 100
        }
    }

  # module.ecs-ec2.aws_ecs_service.app will be created
+   resource "aws_ecs_service" "app" {
+       cluster                            = (known after apply)
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 100
+       desired_count                      = 1
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = false
+       force_new_deployment               = true
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = (known after apply)
+       name                               = "splitrr-prod-backend-ecs-ec2-service"
+       platform_version                   = (known after apply)
+       scheduling_strategy                = "REPLICA"
+       tags                               = {
+           "Name" = "splitrr-prod-backend-ecs-ec2-service"
        }
+       tags_all                           = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-prod-backend-ecs-ec2-service"
+           "Project" = "Splitrr"
        }
+       task_definition                    = (known after apply)
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       capacity_provider_strategy {
+           base              = 1
+           capacity_provider = "splitrr-prod-backend-ecs-ec2-capacity-provider"
+           weight            = 100
        }

+       load_balancer {
+           container_name   = "splitrr-prod-backend-ecs-ec2-container"
+           container_port   = 3001
+           target_group_arn = (known after apply)
#            (1 unchanged attribute hidden)
        }

+       network_configuration {
+           assign_public_ip = false
+           security_groups  = (known after apply)
+           subnets          = (known after apply)
        }

+       ordered_placement_strategy {
+           field = "attribute:ecs.availability-zone"
+           type  = "spread"
        }
    }

  # module.ecs-ec2.aws_ecs_task_definition.app will be created
+   resource "aws_ecs_task_definition" "app" {
+       arn                      = (known after apply)
+       arn_without_revision     = (known after apply)
+       container_definitions    = (known after apply)
+       cpu                      = "1200"
+       execution_role_arn       = (known after apply)
+       family                   = "splitrr-prod-backend-ecs-ec2-task-def"
+       id                       = (known after apply)
+       memory                   = "700"
+       network_mode             = "awsvpc"
+       requires_compatibilities = [
+           "EC2",
        ]
+       revision                 = (known after apply)
+       skip_destroy             = false
+       tags                     = {
+           "Name" = "splitrr-prod-backend-ecs-ec2-task-def"
        }
+       tags_all                 = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-prod-backend-ecs-ec2-task-def"
+           "Project" = "Splitrr"
        }
+       task_role_arn            = (known after apply)
+       track_latest             = false
    }

  # module.ecs-ec2.aws_iam_instance_profile.ecs_node will be created
+   resource "aws_iam_instance_profile" "ecs_node" {
+       arn         = (known after apply)
+       create_date = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
+       name_prefix = "splitrr-prod-backend-ecs-ec2-node-profile"
+       path        = "/ecs/instance/"
+       role        = (known after apply)
+       tags_all    = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }
+       unique_id   = (known after apply)
    }

  # module.ecs-ec2.aws_iam_policy.ecs_exec_policy will be created
+   resource "aws_iam_policy" "ecs_exec_policy" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       description      = "Policy for ECS tasks to access Secrets Manager"
+       id               = (known after apply)
+       name             = "splitrr-prod-backend-ecs-ec2-ecs-exec-policy"
+       name_prefix      = (known after apply)
+       path             = "/"
+       policy           = (known after apply)
+       policy_id        = (known after apply)
+       tags_all         = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }
    }

  # module.ecs-ec2.aws_iam_policy.ecs_task_policy will be created
+   resource "aws_iam_policy" "ecs_task_policy" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       description      = "Policy for ECS tasks to access Cognito"
+       id               = (known after apply)
+       name             = "splitrr-prod-backend-ecs-ec2-ecs-task-policy"
+       name_prefix      = (known after apply)
+       path             = "/"
+       policy           = (known after apply)
+       policy_id        = (known after apply)
+       tags_all         = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }
    }

  # module.ecs-ec2.aws_iam_role.ecs_exec_role will be created
+   resource "aws_iam_role" "ecs_exec_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "splitrr-prod-backend-ecs-ec2-exec-role"
+       path                  = "/"
+       tags_all              = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.ecs-ec2.aws_iam_role.ecs_node_role will be created
+   resource "aws_iam_role" "ecs_node_role" {
Plan is too large to fit in a PR comment. See the full plan in the workflow log.
```
</details>

:memo: Plan generated in [CICD for Splitrr Infra #67](https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10684751080)